pandas基于numpy的，继承了numpy良好的数组计算功能，同时又提供了更加精细的数据计算能力

终端中安装pandas：  
```
pip3 install pandas
pip install pandas
```

# 1 单个Series

和numpy的一维数组很相似，但是Series可以自己制定索引（标签索引，是左闭右闭的）

In [1]:
import pandas as pd

In [2]:
s1 = pd.Series([1, 5, 6, 18])  # Series第一个字母大写，说明这是一个构造函数，会返还给我们一个实例对象
s1

0     1
1     5
2     6
3    18
dtype: int64

In [3]:
s1.values

array([ 1,  5,  6, 18])

In [4]:
s1.index  # index是左闭右开的

RangeIndex(start=0, stop=4, step=1)

### 1.2 Series的索引和切片

#### 1.2.1 Series的索引

In [5]:
s1[1]  # 索引出来的是值

5

#### 1.2.2 Series的切片

In [6]:
s1[1:3]  # 切片出来即有值也有索引

1    5
2    6
dtype: int64

Series的索引可以自己设定，自己设定之后原来的位置索引仍然管用；自己设定的叫做标签索引，远啦的叫做位置索引

In [7]:
s2 = pd.Series([1, 5, 7, 9], index=["a", "d", "b", "c"])
s2

a    1
d    5
b    7
c    9
dtype: int64

#### 1.2.3 标签索引

In [8]:
s2["a"]  # 当位置和标签都是整数时，优先标签索引

1

#### 1.2.4 标签切片

In [9]:
s2["a":"d"]  # 标签索引切片时是又闭的

a    1
d    5
dtype: int64

### 1.3 Series的列表索引

In [10]:
s2[["a", "b", "d"]]  # 位置的顺序可以不受限制

a    1
b    7
d    5
dtype: int64

<font color="#dd000">索引取值按标签，切片取值时用位置</font>

### 1.4 Series的loc（标签索引）和iloc（位置索引）

In [11]:
s2 = pd.Series([1, 5, 7, 9], index=["a", "d", "b", "c"])
print(s2.loc["a"])
print(s2.loc["a":"d"])

1
a    1
d    5
dtype: int64

In [12]:
s2.iloc[1:3]

d    5
b    7
dtype: int64

创建Series索引的另外一种方式：给Series传入一个字典

In [13]:
s3 = pd.Series({"青菜": 4.1, "白萝卜": 2.2, "西红柿": 5.3, "土豆": 3.7, "黄瓜": 6.8})
s3

青菜     4.1
白萝卜    2.2
西红柿    5.3
土豆     3.7
黄瓜     6.8
dtype: float64

字典的键会直接变成标签索引，字典的值就变为Series的值

In [14]:
s3["青菜"] = 4.3  # 也可以像之前那样改字典里面的值
s3

青菜     4.3
白萝卜    2.2
西红柿    5.3
土豆     3.7
黄瓜     6.8
dtype: float64

如果标签也是整数就容易搞混，怎么办呢？用loc标签索引和iloc位置索引

In [15]:
s3.loc["青菜"] = 4.5
s3.iloc[1] = 5.6
s3

青菜     4.5
白萝卜    5.6
西红柿    5.3
土豆     3.7
黄瓜     6.8
dtype: float64

In [16]:
s3 > 5  # 会返回一个布尔值和标签索引组成的Series

青菜     False
白萝卜     True
西红柿     True
土豆     False
黄瓜      True
dtype: bool

In [17]:
s3[s3 > 5]  # 把条件作为索引就可以搜索出满足条件的元素组成的Series

白萝卜    5.6
西红柿    5.3
黄瓜     6.8
dtype: float64

In [18]:
s3[(s3 > 5) | (s3 < 3)]

白萝卜    5.6
西红柿    5.3
黄瓜     6.8
dtype: float64

#### 练习：

写出导入pandas的语句并命名为pd

In [19]:
import pandas as pd

创建一个叫s1的Series，里面包含元素-1.2\3.7\2.5\-8.2\6.3。创建后进行输出。

In [20]:
s1 = pd.Series([-1.2, 3.7,2.5 , -8.2, 6.3])
s1

0   -1.2
1    3.7
2    2.5
3   -8.2
4    6.3
dtype: float64

打印s1所有索引和元素值

In [21]:
print(s1.values)
print(s1.index)

[-1.2  3.7  2.5 -8.2  6.3]
RangeIndex(start=0, stop=5, step=1)

创建一个叫做s2的Series，里面包含元素1、2、3、4、5，并且对应的索引是5、4、3、2、1

In [22]:
s2 = pd.Series([1, 2, 3, 4, 5], index=["5", "4", "3", "2", "1"])
s2 = pd.Series({"5":1, "4":2, "3":3, "2":4, "1":5})
s2

5    1
4    2
3    3
2    4
1    5
dtype: int64

输出s2里面按位置排在第二的元素

In [23]:
s2[1]

2

In [24]:
s2.iloc[1]

2

输出s2中按标签对应从5到3（包括3）范围内的元素

In [25]:
s2.loc["5":"3"]

5    1
4    2
3    3
dtype: int64

通过一个字典创建Series3。字典的键为：小李、小陈、小张、小曾、小邓，值为82、93、91、78、68。创建后进行输出。

In [26]:
s3 = pd.Series({"小李":82, "小陈":93, "小张":91, "小曾":78, "小邓":86})
s3

小李    82
小陈    93
小张    91
小曾    78
小邓    86
dtype: int64

把s3中小张对应的值改为95，在输出s3

In [27]:
s3.loc["小张"] = 95
s3

小李    82
小陈    93
小张    95
小曾    78
小邓    86
dtype: int64

输出s3中所有大于80且小于90的元素。

In [28]:
s3[(s3 > 80) & (s3 < 90)]

小李    82
小邓    86
dtype: int64

# 2 多个Series

pandas可以进行加减乘除操作，pandas会自动根据索引自动对齐并排序，匹配不上的索引就会是Nan表示not a number

In [29]:
import pandas as pd

### 2.1 Series的四则运算

In [30]:
s1 = pd.Series([1, 4, 2, 3, 5], index=[1, 3, 5, 7, 9])
s2 = pd.Series([8, 1, 7, 3, 9], index=[1, 2, 3, 5, 10])
s1+s2

1      9.0
2      NaN
3     11.0
5      5.0
7      NaN
9      NaN
10     NaN
dtype: float64

用方法把缺失值补上

In [31]:
s1.add(s2, fill_value=0)  # 缺少的值会用0代替

1      9.0
2      1.0
3     11.0
5      5.0
7      3.0
9      5.0
10     9.0
dtype: float64

In [32]:
s2.add(s1, fill_value=0)

1      9.0
2      1.0
3     11.0
5      5.0
7      3.0
9      5.0
10     9.0
dtype: float64

In [33]:
s1 - s2

1    -7.0
2     NaN
3    -3.0
5    -1.0
7     NaN
9     NaN
10    NaN
dtype: float64

In [34]:
s1.sub(s2, fill_value=0)

1    -7.0
2    -1.0
3    -3.0
5    -1.0
7     3.0
9     5.0
10   -9.0
dtype: float64

In [35]:
s1 * s2

1      8.0
2      NaN
3     28.0
5      6.0
7      NaN
9      NaN
10     NaN
dtype: float64

In [36]:
s1.mul(s2, fill_value=0)

1      8.0
2      0.0
3     28.0
5      6.0
7      0.0
9      0.0
10     0.0
dtype: float64

In [37]:
s1 / s2

1     0.125000
2          NaN
3     0.571429
5     0.666667
7          NaN
9          NaN
10         NaN
dtype: float64

In [38]:
s1.div(s2, fill_value=0)

1     0.125000
2     0.000000
3     0.571429
5     0.666667
7          inf
9          inf
10    0.000000
dtype: float64

In [39]:
s3 = pd.Series([92, 67, 70, 88, 76], index=["小明", "小红", "小杰", "小丽", "小华"])
s4 = pd.Series([95, 85, 60, 79, 76], index=["小明", "小娟", "小杰", "小同", "小与"])

In [40]:
s3 + s4

小与      NaN
小丽      NaN
小华      NaN
小同      NaN
小娟      NaN
小明    187.0
小杰    130.0
小红      NaN
dtype: float64

In [41]:
s3.add(s4, fill_value=0)

小与     76.0
小丽     88.0
小华     76.0
小同     79.0
小娟     85.0
小明    187.0
小杰    130.0
小红     67.0
dtype: float64

### 2.2 Series的统计描述

In [42]:
print(s1.max())
print(s1.min())
print(s1.mean())
print(s1.sum())

5
1
3.0
15

In [43]:
print(max(s1))

5

In [44]:
s1.describe()  # Series的统计描述

count    5.000000
mean     3.000000
std      1.581139
min      1.000000
25%      2.000000
50%      3.000000
75%      4.000000
max      5.000000
dtype: float64

### 2.3 对元素分别进行操作（广播机制）

In [45]:
s1 * 5

1     5
3    20
5    10
7    15
9    25
dtype: int64

apply方法可以把函数运用到Series中的每一个元素上

In [46]:
scores = pd.Series([92, 67, 70, 88, 76], index=["小明", "小红", "小杰", "小丽", "小华"])

def score_grade(score):
    if score >= 90:
        return "A"
    elif 90  >  score >= 80:
        return "B"
    elif 80  >  score >= 70:
        return "C"
    elif 70  >  score >= 60:
        return "D"
    else:
        return "E"
    
grades = scores.apply(score_grade)  # apply方法不会改变原始Series而是会输出一个新的Series
print(grades)

小明    A
小红    D
小杰    C
小丽    B
小华    C
dtype: object

In [47]:
series_square = scores.apply(lambda score: score ** 2)
print(series_square)

小明    8464
小红    4489
小杰    4900
小丽    7744
小华    5776
dtype: int64

# 3 DataFrame

## 3.1 DataFrame的构造

In [48]:
import pandas as pd

**构造方法一**

In [49]:
s_id = pd.Series(["01", "02", "03", "04", "05"])
s_class = pd.Series(["二班", "一班", "三班", "一班", "二班"])
s_grade = pd.Series([92, 67, 70, 88, 76])
df1 = pd.DataFrame({"学号": s_id, "班级": s_class, "成绩": s_grade})
df1

   学号  班级  成绩
0  01  二班  92
1  02  一班  67
2  03  三班  70
3  04  一班  88
4  05  二班  76

把DataFrame的每一列和所有标签索引对应起来看作是一个Series，列名看作是键，列名与每一个Series构成一个键值对

In [50]:
s_id = pd.Series(["01", "02", "03", "04", "05"], index=["小明", "小黄", "小红", "小张", "小黑"])
s_class = pd.Series(["二班", "一班", "三班", "一班", "二班"],index=["小明", "小黄", "小红", "小张", "小黑"])
s_grade = pd.Series([92, 67, 70, 88, 76], index=["小明", "小黄", "小红", "小张", "小黑"])
df2 = pd.DataFrame({"学号": s_id, "班级": s_class, "成绩": s_grade})
df2
# 必须还得每个Series都加上标签才能改变DataFrame的标签

    学号  班级  成绩
小明  01  二班  92
小黄  02  一班  67
小红  03  三班  70
小张  04  一班  88
小黑  05  二班  76

**嵌套字典构造DataFrame**

In [51]:
df4 = pd.DataFrame({"学号": {"小明":"01", "小黄":"02", "小红":"03", "小张":"04", "小黑":"05"},
                    "班级": {"小明":"二班", "小黄":"一班", "小红":"三班", "小张":"一班", "小黑":"二班"},
                    "成绩": {"小明":92, "小黄":67, "小红":70, "小张":88, "小黑":76}})
df4

    学号  班级  成绩
小明  01  二班  92
小黄  02  一班  67
小红  03  三班  70
小张  04  一班  88
小黑  05  二班  76

## 3.2 DataFrame的索引

### 3.2.1 获得列名、索引和值

In [52]:
df4.index

Index(['小明', '小黄', '小红', '小张', '小黑'], dtype='object')

In [53]:
df4.columns

Index(['学号', '班级', '成绩'], dtype='object')

In [54]:
df4.values  # 返还出的类型是Numpy数组，那么可以用于Numpy数组的就可以用到这个上了

array([['01', '二班', 92],
       ['02', '一班', 67],
       ['03', '三班', 70],
       ['04', '一班', 88],
       ['05', '二班', 76]], dtype=object)

In [55]:
df4.T  # DataFrame转置，转置之后生成一个新的DataFrame不会对原来的DataFrame改变

    小明  小黄  小红  小张  小黑
学号  01  02  03  04  05
班级  二班  一班  三班  一班  二班
成绩  92  67  70  88  76

### 3.2.2 提取DataFrame中的元素

**提取列**

In [56]:
df4["班级"]  # DataFrame名["列名"]，返回出来的是一个Series

小明    二班
小黄    一班
小红    三班
小张    一班
小黑    二班
Name: 班级, dtype: object

In [57]:
df4[["班级"]]

    班级
小明  二班
小黄  一班
小红  三班
小张  一班
小黑  二班

**DataFrame的每一列也是DataFrame的属性，用属性名获取DataFrame的列也是一样的**

In [58]:
df4.班级

小明    二班
小黄    一班
小红    三班
小张    一班
小黑    二班
Name: 班级, dtype: object

In [59]:
df5 = pd.DataFrame({"学号": {"小明":"01", "小黄":"02", "小红":"03", "小张":"04", "小黑":"05"},
                    "班级": {"小明":"二班", "小黄":"一班", "小红":"三班", "小张":"一班", "小黑":"二班"},
                    "成绩-100": {"小明":92, "小黄":67, "小红":70, "小张":88, "小黑":76}})
df5

    学号  班级  成绩-100
小明  01  二班      92
小黄  02  一班      67
小红  03  三班      70
小张  04  一班      88
小黑  05  二班      76

```python
df5.成绩-100  # 当属性名中出现特殊符号时用属性名就不能提取出Series了就只能用方括号索引了
```

In [60]:
df5["成绩-100"]

小明    92
小黄    67
小红    70
小张    88
小黑    76
Name: 成绩-100, dtype: int64

**提取多个列,再放括号里面放入列表**

In [61]:
df4[["学号","班级"]]

    学号  班级
小明  01  二班
小黄  02  一班
小红  03  三班
小张  04  一班
小黑  05  二班

**提取行**

In [62]:
df4.loc["小红"]

学号    03
班级    三班
成绩    70
Name: 小红, dtype: object

In [63]:
df4.iloc[2]

学号    03
班级    三班
成绩    70
Name: 小红, dtype: object

**切片**

In [64]:
df4.loc["小明":"小红"]

    学号  班级  成绩
小明  01  二班  92
小黄  02  一班  67
小红  03  三班  70

In [65]:
df4.iloc[0:3]

    学号  班级  成绩
小明  01  二班  92
小黄  02  一班  67
小红  03  三班  70

In [66]:
df4.loc["小明":"小红"] == df4.iloc[0:3]  # 标签索引切片包含最后一个值，位置索引不包含最后一个值

      学号    班级    成绩
小明  True  True  True
小黄  True  True  True
小红  True  True  True

In [67]:
df4.iloc[[3, 1]]

    学号  班级  成绩
小张  04  一班  88
小黄  02  一班  67

In [68]:
df4.loc[["小张", "小黄"]]

    学号  班级  成绩
小张  04  一班  88
小黄  02  一班  67

In [69]:
df4.loc["小明":"小张", "学号": "成绩"]

    学号  班级  成绩
小明  01  二班  92
小黄  02  一班  67
小红  03  三班  70
小张  04  一班  88

In [70]:
df4.iloc[0:3, 0:2]

    学号  班级
小明  01  二班
小黄  02  一班
小红  03  三班

In [71]:
df4.iloc[0:4, 0:3]

    学号  班级  成绩
小明  01  二班  92
小黄  02  一班  67
小红  03  三班  70
小张  04  一班  88

In [72]:
df4.iloc[0:4, [2, 0]]

    成绩  学号
小明  92  01
小黄  67  02
小红  70  03
小张  88  04

**提取表格数据**

In [73]:
df4.loc["小张", "班级"]

'一班'

In [74]:
df4.iloc[3, 1]

'一班'

In [75]:
df4.loc["小张", "班级"] == df4.iloc[3, 1]

True

**筛选DataFrame中符合条件的行数据**

In [76]:
df4["成绩"] > 80

小明     True
小黄    False
小红    False
小张     True
小黑    False
Name: 成绩, dtype: bool

In [77]:
df4.成绩 > 80

小明     True
小黄    False
小红    False
小张     True
小黑    False
Name: 成绩, dtype: bool

In [78]:
df4[df4["成绩"] > 80]

    学号  班级  成绩
小明  01  二班  92
小张  04  一班  88

In [79]:
df4[df4["班级"] == "一班"]

    学号  班级  成绩
小黄  02  一班  67
小张  04  一班  88

In [80]:
df4[(df4["成绩"] > 80) & (df4["班级"] == "一班")]

    学号  班级  成绩
小张  04  一班  88

**获得DataFrame中的前几行**

In [81]:
df4.head()  # 不输入参数就默认前面五行

    学号  班级  成绩
小明  01  二班  92
小黄  02  一班  67
小红  03  三班  70
小张  04  一班  88
小黑  05  二班  76

In [82]:
df4.head(2)

    学号  班级  成绩
小明  01  二班  92
小黄  02  一班  67

## 3.3 内部操作

In [83]:
name = pd.Series(["小陈", "小李", "小王", "小张", "小赵", "小周"], index=["001", "002", "003", "004", "005", "006"])
gender = pd.Series(["女", "女", "男", "男", "女", "男"], index=["006", "005", "004", "003", "002", "001"])
height = pd.Series([172.5, 168.0, 178.2, 181.3, 161.7,178.9], index=["001", "002", "003", "004", "005", "006"])
students = pd.DataFrame({"姓名":name, "性别":gender,"身高":height})
students1 = pd.DataFrame({"姓名":name, "性别":gender,"身高":height})
students  # DataFrame由字典构成

     姓名 性别     身高
001  小陈  男  172.5
002  小李  女  168.0
003  小王  男  178.2
004  小张  男  181.3
005  小赵  女  161.7
006  小周  女  178.9

**用Series修改DataFrame**

In [84]:
students["身高"] = pd.Series([162.5, 167.0, 178.2, 181.3, 161.7,178.9])
students  # 不注明索引就会出现NaN

     姓名 性别  身高
001  小陈  男 NaN
002  小李  女 NaN
003  小王  男 NaN
004  小张  男 NaN
005  小赵  女 NaN
006  小周  女 NaN

In [85]:
students["身高"] = pd.Series([162.5, 167.0, 178.2, 181.3, 161.7,178.9], index=["001", "002", "003", "004", "005", "006"])
students

     姓名 性别     身高
001  小陈  男  162.5
002  小李  女  167.0
003  小王  男  178.2
004  小张  男  181.3
005  小赵  女  161.7
006  小周  女  178.9

**用列表修改DataFrame的列**

In [86]:
students["性别"] = ["男", "女", "男", "男", "女", "男"]
students

     姓名 性别     身高
001  小陈  男  162.5
002  小李  女  167.0
003  小王  男  178.2
004  小张  男  181.3
005  小赵  女  161.7
006  小周  男  178.9

**添加DataFrame的列**

In [87]:
students["成绩"] = [92, 78, 98, 89, 56, 78]
students

     姓名 性别     身高  成绩
001  小陈  男  162.5  92
002  小李  女  167.0  78
003  小王  男  178.2  98
004  小张  男  181.3  89
005  小赵  女  161.7  56
006  小周  男  178.9  78

**DataFrame中添加多列**

In [88]:
students1[["成绩1", "身高1"]] = students[["成绩", "身高"]]
students1

     姓名 性别     身高  成绩1    身高1
001  小陈  男  172.5   92  162.5
002  小李  女  168.0   78  167.0
003  小王  男  178.2   98  178.2
004  小张  男  181.3   89  181.3
005  小赵  女  161.7   56  161.7
006  小周  女  178.9   78  178.9

**DataFrame修改行**

In [89]:
students.loc["001"] = pd.Series(["小赵", "男", 178.4, 89], index=["姓名", "性别", "身高", "成绩"])
students

     姓名 性别     身高  成绩
001  小赵  男  178.4  89
002  小李  女  167.0  78
003  小王  男  178.2  98
004  小张  男  181.3  89
005  小赵  女  161.7  56
006  小周  男  178.9  78

**DataFrame中添加行**

In [90]:
students.loc["001"] = ["小赵", "男", 178.4, 89]
students

     姓名 性别     身高  成绩
001  小赵  男  178.4  89
002  小李  女  167.0  78
003  小王  男  178.2  98
004  小张  男  181.3  89
005  小赵  女  161.7  56
006  小周  男  178.9  78

In [91]:
students.loc["006"] = pd.Series(["小刘", "女", 171.4, 79], index=["姓名", "性别", "身高", "成绩"])
students

     姓名 性别     身高  成绩
001  小赵  男  178.4  89
002  小李  女  167.0  78
003  小王  男  178.2  98
004  小张  男  181.3  89
005  小赵  女  161.7  56
006  小刘  女  171.4  79

In [92]:
students.loc["007"] = ["小温", "女", 171.4, 79]
students

     姓名 性别     身高  成绩
001  小赵  男  178.4  89
002  小李  女  167.0  78
003  小王  男  178.2  98
004  小张  男  181.3  89
005  小赵  女  161.7  56
006  小刘  女  171.4  79
007  小温  女  171.4  79

<font color="#dd000">**DataFrame中改变行最好用loc，因为iloc只能对存在的进行操作**</front>

**DataFrame中删除行或列：drop不会改变原来的DataFrame，而是会返回一个新的DataFrame**

In [93]:
students.drop(["003","005"])

     姓名 性别     身高  成绩
001  小赵  男  178.4  89
002  小李  女  167.0  78
004  小张  男  181.3  89
006  小刘  女  171.4  79
007  小温  女  171.4  79

**删除列要加 axis=1**

In [94]:
students.drop(["性别","身高"], axis=1)
# axis表示轴，axis=0表示纵向进行操作，axis=1表示横向进行操作，删除列。DataFrame默认纵向进行操作

     姓名  成绩
001  小赵  89
002  小李  78
003  小王  98
004  小张  89
005  小赵  56
006  小刘  79
007  小温  79

## 3.3 DataFrame之间的操作

DataFrame加DataFrame时会根据索引以及列名来对齐，索引和列都需要考虑到。对不上的就会出现NaN。

In [95]:
import pandas as pd

In [96]:
l1 = pd.Series([0, 4, 8, 12], index=["001", "003", "005", "007"])
l2 = pd.Series([1, 5, 9, 13], index=["001", "003", "005", "007"])
l3 = pd.Series([2, 6, 10, 14], index=["001", "003", "005", "007"])
l4 = pd.Series([3, 7, 11, 15], index=["001", "003", "005", "007"])

In [97]:
df1 = pd.DataFrame({"a":l1, "b":l2, "c":l3, "d":l4})
df1

      a   b   c   d
001   0   1   2   3
003   4   5   6   7
005   8   9  10  11
007  12  13  14  15

In [98]:
l_1 = pd.Series([0, 3, 6])
l_2 = pd.Series([1, 4, 7])
l_3 = pd.Series([2, 5, 8])

In [99]:
df2 = pd.DataFrame({"a":l_1, "b":l_2, "c":l_3})
df2

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [100]:
df1 + df2

      a   b   c   d
001 NaN NaN NaN NaN
003 NaN NaN NaN NaN
005 NaN NaN NaN NaN
007 NaN NaN NaN NaN
0   NaN NaN NaN NaN
1   NaN NaN NaN NaN
2   NaN NaN NaN NaN

In [101]:
df1.add(df2, fill_value=0)

        a     b     c     d
001   0.0   1.0   2.0   3.0
003   4.0   5.0   6.0   7.0
005   8.0   9.0  10.0  11.0
007  12.0  13.0  14.0  15.0
0     0.0   1.0   2.0   NaN
1     3.0   4.0   5.0   NaN
2     6.0   7.0   8.0   NaN

In [102]:
df1.sub(df2, fill_value=0)

        a     b     c     d
001   0.0   1.0   2.0   3.0
003   4.0   5.0   6.0   7.0
005   8.0   9.0  10.0  11.0
007  12.0  13.0  14.0  15.0
0     0.0  -1.0  -2.0   NaN
1    -3.0  -4.0  -5.0   NaN
2    -6.0  -7.0  -8.0   NaN

In [103]:
df1.mul(df2, fill_value=0)

       a    b    c    d
001  0.0  0.0  0.0  0.0
003  0.0  0.0  0.0  0.0
005  0.0  0.0  0.0  0.0
007  0.0  0.0  0.0  0.0
0    0.0  0.0  0.0  NaN
1    0.0  0.0  0.0  NaN
2    0.0  0.0  0.0  NaN

In [104]:
df1.div(df2, fill_value=0)  # 这里出现NaN是因为零除零，jupyter也不知道是什么

       a    b    c    d
001  NaN  inf  inf  inf
003  inf  inf  inf  inf
005  inf  inf  inf  inf
007  inf  inf  inf  inf
0    NaN  0.0  0.0  NaN
1    0.0  0.0  0.0  NaN
2    0.0  0.0  0.0  NaN

**Series与DataFrame的运算**

In [105]:
s1 = pd.Series([0.1, 0.2, 0.3, 0.4, 0.5], index=["a", "b", "c", "d", "e"])
s1

a    0.1
b    0.2
c    0.3
d    0.4
e    0.5
dtype: float64

In [106]:
s1 * df1

       a    b    c    d   e
001  0.0  0.2  0.6  1.2 NaN
003  0.4  1.0  1.8  2.8 NaN
005  0.8  1.8  3.0  4.4 NaN
007  1.2  2.6  4.2  6.0 NaN

In [107]:
name = pd.Series(["小陈", "小李", "小王", "小张", "小赵", "小周"], index=["001", "002", "003", "004", "005", "006"])
gender = pd.Series(["女", "女", "男", "男", "女", "男"], index=["006", "005", "004", "003", "002", "001"])
height = pd.Series([172.5, 168.0, 178.2, 181.3, 161.7, 159.8], index=["001", "002", "003", "004", "005", "006"])
grade = pd.Series([89, 92, 82, 96, 93, 84], index=["001", "002", "003", "004", "005", "006"])
df2 = pd.DataFrame({"姓名": name, "性别": gender, "身高": height, "成绩": grade})
df2

     姓名 性别     身高  成绩
001  小陈  男  172.5  89
002  小李  女  168.0  92
003  小王  男  178.2  82
004  小张  男  181.3  96
005  小赵  女  161.7  93
006  小周  女  159.8  84

In [108]:
df2 * 5  # 字符串乘以一个数字会出现字符串连着重复

             姓名     性别     身高   成绩
001  小陈小陈小陈小陈小陈  男男男男男  862.5  445
002  小李小李小李小李小李  女女女女女  840.0  460
003  小王小王小王小王小王  男男男男男  891.0  410
004  小张小张小张小张小张  男男男男男  906.5  480
005  小赵小赵小赵小赵小赵  女女女女女  808.5  465
006  小周小周小周小周小周  女女女女女  799.0  420

In [109]:
df2[["身高","成绩"]] * 5  # 那怎么才能在原来的上面操作，只让原来的DataFrame中的数字乘以5

        身高   成绩
001  862.5  445
002  840.0  460
003  891.0  410
004  906.5  480
005  808.5  465
006  799.0  420

## 3.4 DataFrame函数操作

In [110]:
students = pd.DataFrame({"姓名": {"001": "小陈", "002": "小李", "003": "小王", "004": "小张"},
 "考试1": {"001": 85, "002": 91, "003": 86, "004": 79},
 "考试2": {"001": 95, "002": 92, "003": 81, "004": 89},
 "考试3": {"001": 92, "002": 94, "003": 89, "004": 95}
 })
students

     姓名  考试1  考试2  考试3
001  小陈   85   95   92
002  小李   91   92   94
003  小王   86   81   89
004  小张   79   89   95

In [111]:
students_2 = students.drop("姓名", axis=1)
students_2

     考试1  考试2  考试3
001   85   95   92
002   91   92   94
003   86   81   89
004   79   89   95

In [112]:
students_2.mean()

考试1    85.25
考试2    89.25
考试3    92.50
dtype: float64

In [113]:
students_2.mean(axis=1)

001    90.666667
002    92.333333
003    85.333333
004    87.666667
dtype: float64

In [114]:
def trim_mean(data):
    data_sum = data.sum()
    data_max = data.max()
    data_min = data.min()
    data_len = len(data)
    return (data_sum - data_min - data_max)/(data_len - 2)

students_2.apply(trim_mean)  # 默认对列进行操作，apply是运用到行或者列上面

考试1    85.5
考试2    90.5
考试3    93.0
dtype: float64

In [115]:
def trim_mean(data):
    data_sum = data.sum()
    data_max = data.max()
    data_min = data.min()
    data_len = len(data)
    return (data_sum - data_min - data_max)/(data_len - 2)

students_2.apply(trim_mean, axis=1)

001    92.0
002    92.0
003    86.0
004    89.0
dtype: float64

In [116]:
students_2.applymap(lambda num:num+10)  # applymap会把函数运用到每一个元素上面

     考试1  考试2  考试3
001   95  105  102
002  101  102  104
003   96   91   99
004   89   99  105

In [117]:
students_2.applymap(lambda num:num+10) == students_2+10

      考试1   考试2   考试3
001  True  True  True
002  True  True  True
003  True  True  True
004  True  True  True

In [118]:
students_2 ** 2 == students_2.applymap(lambda num: num ** 2)

      考试1   考试2   考试3
001  True  True  True
002  True  True  True
003  True  True  True
004  True  True  True

In [119]:
students

     姓名  考试1  考试2  考试3
001  小陈   85   95   92
002  小李   91   92   94
003  小王   86   81   89
004  小张   79   89   95

In [120]:
students.describe()  # DataFrame.describe()会自动忽略掉非数字

             考试1        考试2        考试3
count   4.000000   4.000000   4.000000
mean   85.250000  89.250000  92.500000
std     4.924429   6.020797   2.645751
min    79.000000  81.000000  89.000000
25%    83.500000  87.000000  91.250000
50%    85.500000  90.500000  93.000000
75%    87.250000  92.750000  94.250000
max    91.000000  95.000000  95.000000

In [121]:
students_2.describe(axis=1)

TypeError: describe() got an unexpected keyword argument 'axis'

In [ ]:
students_2.T.describe()